const data = [
    {
        title: 'Роль информационных технологий в науке 0',
        img: 'https://avgrodno.by/wp-content/uploads/2023/12/1.png',
        description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Иванов Михаил Александрович',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'химия'],
        trend: 'khimiya',
        publication_date: '03.05.2024',
        show: 5,
        like: 22,
        id: 1,
        content:[
            `<p>Технологии изменили наш мир до неузнаваемости. Интернет открыл невиданные ранее возможности для общения и обмена информацией. С появлением смартфонов наша жизнь стала более мобильной, а доступ к знаниям и развлечениям стал практически неограниченным. Искусственный интеллект вошел во множество аспектов нашей жизни, повышая эффективность и предоставляя новые возможности для развития.</p>`,
            `<p>Социальные сети стали неизменной частью современной культуры. Люди используют их для общения, делятся своими мыслями и переживаниями, находят единомышленников. Однако, вместе с этим выросли и новые проблемы, такие как кибербуллинг и зависимость от социальных сетей. Тем не менее, их роль в жизни общества остается крайне важной и значимой, влияя на множество аспектов нашего бытия.</p>`,
            `<p>Интернет вещей соединяет различные устройства в одну экосистему, создавая умные города и дома. Данный подход повышает эффективность использования ресурсов и улучшает качество жизни. Однако, растущая зависимость от технологий вызывает вопросы безопасности и приватности данных. Компании должны приложить усилия, чтобы обеспечить надежную защиту информации своих пользователей, минимизируя риски утечек.</p>`,
            `<p>Блокчейн и криптовалюты представляют собой инновационные подходы к финансовым операциям. Эти технологии обеспечивают безопасность и прозрачность транзакций. Однако, их широкое распространение требует регулирования и согласования с финансовым сектором. Блокчейн может быть использован не только в финансовых приложениях, но и в других сферах, таких как здравоохранение и право.</p>`,
            `<p>Автономные транспортные средства, такие как беспилотные автомобили и дроны, предоставляют новые возможности для логистики и транспорта. Их внедрение способствует снижению аварийности и повышению эффективности перевозок. Однако, до широкомасштабного применения этих технологий остается много вопросов, связанных с безопасностью, законодательством и этическими аспектами.</p>`,
            `<p>Машинное обучение и искусственный интеллект находят применение в здравоохранении, образовании и бизнесе. Эти технологии способны анализировать огромные массивы данных, прогнозировать тенденции и предлагать решения. В здравоохранении они могут помогать в диагностике заболеваний и разработке индивидуальных планов лечения. В образовании - создавать персонализированные программы обучения для студентов.</p>`,
            `<p>Технологии виртуальной и дополненной реальности открывают новые горизонты в области развлечений, обучения и работы. Виртуальные миры позволяют пользователям погружаться в полностью цифровую среду, а дополненная реальность - усовершенствовать восприятие окружающего мира. Эти технологии применяются в различных сферах, от игровой индустрии до медицины, делая процессы более увлекательными и эффективными.</p>`,
            `<p>Облачные вычисления предоставляют надежные и гибкие ресурсы для хранения данных и выполнения различных задач. Компании могут масштабировать свои приложения и услуги, не заботясь о физической инфраструктуре. Однако, важным аспектом остается безопасность данных. Необходимо обеспечивать защиту информации пользователей, выбирая надежных провайдеров и внедряя современные методы шифрования.</p>`,
            `<p>Развитие технологий связи, таких как 5G, обеспечит более высокие скорости передачи данных и улучшит качество интернета. Это открывает новые возможности для развития интернета вещей, автономных транспортных систем и других технологий. Однако, внедрение 5G требует значительных инвестиций и разработки новой инфраструктуры. Также важно учитывать экологические аспекты и возможное воздействие на здоровье людей.</p>`,
            `<p>Будущее технологий представляется захватывающим и полным новых возможностей. Важно быть готовыми к изменениям и активно адаптироваться к новым реалиям. Необходимо развивать навыки, которые будут актуальными в будущем, и использовать технологии для улучшения качества жизни. Образование и постоянное обучение станут важнейшими аспектами успешной адаптации к быстро меняющемуся миру технологий.</p>`,

        ]
    },
    {
        title: 'IT-технологии в физике: новые горизонты исследований',
        img: 'https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_6537a73b3831625d2305a172_6537bd8c3e0e3332ecb4db8c/scale_1200',   
        description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Воронцова Ксения Фёдоровна',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'химия'],
        trend: 'khimiya',
        publication_date: '01.05.2024',
        show: 15,
        like: 22,
        id: 2,
        content:[ 
            `<p>Развитие технологий интернета позволило значительно улучшить качество жизни. Мы получили доступ к массивам информации, которые ранее были недоступны. Онлайн-обучение, телемедицина и дистанционная работа стали обычным явлением. Широкие возможности общения и обмена данными увеличили глобализацию и ускорили процесс обмена знаниями и идеями.</p>`,

            `<p>Исследования в области искусственного интеллекта продолжают впечатлять. Глубокое обучение и нейронные сети находят применение в различных отраслях. Автоматизация рутинных процессов и улучшение аналитических систем повышают эффективность работы. Однако важным аспектом остается этичное использование технологий, чтобы они приносили пользу обществу.</p>`,
        
            `<p>Социальные сети открывают новые возможности для взаимодействия и самовыражения. Миллионы людей ежедневно делятся своими мыслями и опытом. Важно помнить о цифровой гигиене и кибербезопасности. Компании разрабатывают новые инструменты для защиты личных данных пользователей и борьбы с киберугрозами, обеспечивая безопасное использование платформ.</p>`,
        
            `<p>Проектирование умных городов становится актуальной задачей для урбанистов. Использование интернета вещей помогает улучшить управление городскими ресурсами. Система умных светофоров, мониторинг состояния окружающей среды и контроля энергопотребления делают города более удобными и экологически чистыми. Тактико-стратегические планы разрабатываются на основе анализа данных.</p>`,
        
            `<p>Блокчейн-технологии внедряются не только в финансовом секторе, но и в других областях. Прозрачность и безопасность транзакций делают блокчейн привлекательным для логистики и управления цепочками поставок. Однако требуется законодательная база, которая обеспечит правовую защиту и предсказуемость использования этих технологий в долгосрочной перспективе.</p>`,
        
            `<p>Автомобильная индустрия переживает революцию благодаря автономным транспортным средствам. Беспилотные автомобили обещают снизить аварийность и улучшить дорожную ситуацию. Однако важно заранее решить вопросы правового регулирования, а также обеспечить высокую надежность и безопасность таких систем в реальных условиях эксплуатации.</p>`,
        
            `<p>Развитие облачных технологий позволяет компаниям и частным пользователям хранить и обрабатывать данные на удаленных серверах. Облака предоставляют гибкость и масштабируемость, снижая затраты на поддержание инфраструктуры. Но остается необходимость в строгом контроле безопасности данных и защите информации от возможных кибератак и взломов.</p>`,       
        
        ]
    },
    {
        title: 'Роль информационных технологий в науке 2',
        img: 'https://100-faktov.ru/wp-content/uploads/2018/02/752ab2667107d0101a1b.jpg',  
        description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Никитина Амина Ильинична',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'химия'],
        trend: 'khimiya',
        publication_date: '03.02.2023',
        show: 5,
        like: 22, 
        id: 3,
        content:[
            `<p>Блокчейн-технологии внедряются не только в финансовом секторе, но и в других областях. Прозрачность и безопасность транзакций делают блокчейн привлекательным для логистики и управления цепочками поставок. Однако требуется законодательная база, которая обеспечит правовую защиту и предсказуемость использования этих технологий в долгосрочной перспективе.</p>`,

            `<p>Автомобильная индустрия переживает революцию благодаря автономным транспортным средствам. Беспилотные автомобили обещают снизить аварийность и улучшить дорожную ситуацию. Однако важно заранее решить вопросы правового регулирования, а также обеспечить высокую надежность и безопасность таких систем в реальных условиях эксплуатации.</p>`,
        
            `<p>Развитие облачных технологий позволяет компаниям и частным пользователям хранить и обрабатывать данные на удаленных серверах. Облака предоставляют гибкость и масштабируемость, снижая затраты на поддержание инфраструктуры. Но остается необходимость в строгом контроле безопасности данных и защите информации от возможных кибератак и взломов.</p>`,
        
            `<p>Инновации в области биотехнологий открывают новые горизонты в медицине и сельском хозяйстве. Генетическое редактирование и персонализированная медицина обещают улучшить качество жизни и увеличить продолжительность жизни. Этические вопросы также играют важную роль в исследовательской и прикладной деятельности, чтобы минимизировать возможные риски.</p>`,
        
            `<p>Технологии дополненной и виртуальной реальности находят все больше применений в различных областях. Они меняют подход к обучению, развлечениям и работе. Обучающие симуляторы и интерактивные туры предоставляют новые возможности для изучения предметов и навыков. Важно продолжать исследования по улучшению пользовательского опыта и безопасности использования AR/VR-технологий.</p>`,
        
            `<p>Энергетическая отрасль активно внедряет устойчивые технологии производства и использования энергии. Соларные панели, ветряные турбины и умные сети становятся частью новой инфраструктуры. Эти инновации помогают сократить выбросы и улучшить энергоэффективность. Совместные усилия правительств, бизнеса и науки ускоряют переход к экологически чистой энергетике.</p>`,
          
        ]
    },
    {
        title: 'Робототехника: будущее уже здесь 3',
        img: 'https://tlt.ru/wp-content/uploads/2023/03/1647644330_2-amiel-club-p-fizika-krasivie-kartinki-2.jpg',  
        description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Чернова Анна Ивановна',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'химия'],
        trend: 'khimiya',
        publication_date: '01.05.2024',
        show: 45,
        like: 22, id: 4,
        content:[
            `<p>В последние годы стало очевидно, что отрасль информационных технологий является одной из самых быстроразвивающихся в мире. Новые технологии появляются каждый день, а старые устаревают с каждым месяцем. Компании, которые не следят за изменениями в индустрии, рискуют остаться далеко позади своих конкурентов. Поэтому так важно постоянно обновлять свои знания и навыки, чтобы быть в курсе последних трендов. Недавно ученые обнаружили новый вид вируса, который способен обойти большинство существующих антивирусных программ. Компании, которые не обновили свои защитные меры, подвергают себя серьезному риску стать жертвами кибератак. Поэтому следует уделить большое внимание обновлению программного обеспечения и регулярному обучению сотрудников в области информационной безопасности.</p>`,
            `<p>Цифровая трансформация трансформировала бизнес-процессы во многих отраслях. Компании, которые не перешли к использованию цифровых технологий, могут рисковать оставаться в прошлом и упускать возможности для развития. Например, многие банки перешли к онлайн-банкингу, что позволило им сократить издержки и улучшить обслуживание клиентов. Также сфера медицины не осталась в стороне и начала активно использовать цифровые технологии для диагностики и лечения пациентов. В целом, цифровая трансформация может принести множество преимуществ как для бизнеса, так и для общества в целом.</p>`,
            `<p>Интернет стал неотъемлемой частью нашей повседневной жизни. Мы используем его для работы, общения, развлечений и многих других целей. Однако вместе с удобствами Интернета приходят и опасности. В последнее время все чаще случаются кибератаки, когда злоумышленники пытаются получить доступ к личной информации пользователей или организаций. Для защиты от таких атак необходимо следить за обновлениями программного обеспечения, использовать надежные пароли и обучать сотрудников правилам информационной безопасности. Без должной защиты мы можем стать жертвами киберпреступников и понести серьезные убытки.</p>`,
            `<p>Технологии блокчейн начинают находить применение в различных отраслях, начиная от финансов и заканчивая здравоохранением. Благодаря прозрачности и безопасности этой технологии, многие компании видят в ней потенциал для улучшения своих бизнес-процессов. Например, блокчейн может быть использован для повышения эффективности цепочки поставок или для хранения медицинских данных пациентов. Однако внедрение блокчейна требует значительных усилий и инвестиций, поэтому не все компании готовы к такому шагу. Но те, кто решатся на использование этой технологии, могут получить серьезные конкурентные преимущества и укрепить свои позиции на рынке.</p>`,
            `<p>Искусственный интеллект становится все более популярным в различных отраслях, начиная от производства и заканчивая медициной. Благодаря возможности автоматизировать рутинные задачи и анализировать большие данные, искусственный интеллект может значительно улучшить эффективность бизнес-процессов и помочь принимать более обоснованные решения. Например, в розничной торговле искусственный интеллект может предсказывать спрос на определенные товары и оптимизировать запасы на складе, что позволяет снизить издержки и увеличить прибыль. Однако использование искусственного интеллекта требует больших инвестиций и обучения персонала, поэтому не все компании могут себе это позволить.</p>`,
        ]
    },
    {
        title: 'Роль информационных технологий в науке 4',
        img: 'https://sotni.ru/wp-content/uploads/2023/08/matematicheskii-fon-74.webp',  
        description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Моисеев Даниил Семёнович',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'биология'],
        trend: 'biologiya',
        publication_date: '01.05.2024',
        show: 5,
        like: 22, id: 5,
        content:[
            `<p>Искусственный интеллект становится все более популярным в различных отраслях, начиная от производства и заканчивая медициной. Благодаря возможности автоматизировать рутинные задачи и анализировать большие данные, искусственный интеллект может значительно улучшить эффективность бизнес-процессов и помочь принимать более обоснованные решения. Например, в розничной торговле искусственный интеллект может предсказывать спрос на определенные товары и оптимизировать запасы на складе, что позволяет снизить издержки и увеличить прибыль. Однако использование искусственного интеллекта требует больших инвестиций и обучения персонала, поэтому не все компании могут себе это позволить.</p>`,
            `<p>Экологические проблемы становятся все более острыми в современном мире. Из-за загрязнения окружающей среды и изменений климата многие виды животных и растений находятся под угрозой исчезновения. Чтобы сохранить биоразнообразие планеты, необходимо принимать активные меры по охране окружающей среды. Компании также могут внести свой вклад в решение экологических проблем, например, переходя на использование возобновляемых источников энергии или сокращая выбросы вредных веществ в атмосферу. Такие шаги могут не только улучшить состояние окружающей среды, но и принести экономические выгоды компаниям, которые заботятся о природе.</p>`,
            `<p>Глобализация привела к сокращению расстояний между странами и увеличению международной торговли. Компании теперь могут легко расширять свое присутствие на мировом рынке и конкурировать с иностранными компаниями. Однако глобализация также обладает и негативными последствиями, такими как увеличение конкуренции и перераспределение рабочих мест. Для того чтобы выжить в условиях глобализации, компании должны быть гибкими и адаптивными, быстро реагировать на изменения в мировой экономике и постоянно совершенствовать свои продукты и услуги. Только такие компании смогут сохранить свои позиции на рынке и обеспечить свое долгосрочное развитие.</p>`,
            `<p>Инновации играют ключевую роль в развитии современной экономики. Компании, которые инвестируют в научные исследования и разработки новых продуктов, получают конкурентные преимущества и могут стать лидерами своей отрасли. Инновации позволяют сокращать издержки, улучшать качество продукции и расширять ассортимент предлагаемых услуг. Однако не все компании готовы к изменениям и рискуют застрять в прошлом. Для того чтобы оставаться конкурентоспособными, компании должны постоянно искать новые идеи и технологии, которые помогут им преуспеть на рынке и достичь своих бизнес-целей.</p>`,
            `<p>Образование играет важную роль в жизни каждого человека. Оно дает нам знания и навыки, необходимые для развития и самореализации. Однако современная система образования не всегда отвечает на современные вызовы и требования рынка труда. Многие выпускники сталкиваются с проблемой недостатка практических знаний и навыков, которые необходимы для успешной карьеры. Для того чтобы улучшить качество образования, необходимо совершенствовать учебные программы, обновлять учебные материалы и обучать преподавателей современным методикам преподавания. Только такие шаги могут помочь выпускникам стать успешными специалистами и конкурентоспособными на рынке труда.</p>`,
            `<p>Мы живем в эпоху информационного общества, где доступ к знаниям и информации стал легким и быстрым. Интернет позволяет нам получать любую информацию в любое время и из любого места. Однако с ростом объема информации возникает проблема фильтрации и оценки ее достоверности. Не все источники информации можно считать надежными, поэтому важно научиться отличать правду от лжи и критически мыслить. Также следует помнить о защите личной информации в сети, чтобы не стать жертвой киберпреступников. Только обладая хорошими навыками информационной грамотности, мы сможем эффективно использовать ресурсы Интернета и извлечь из них максимальную пользу для себя и для общества.</p>`,]
    },
    {
        title: 'Роль информационных технологий в науке 5',
        img: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSSeqnRVA6B4P-iBX-aIJzn0GwcHW6pRn2fcA&s', 
        description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Марков Евгений Антонович',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'физика'],
        trend: 'fizika',
        publication_date: '01.05.2024',
        show: 45,
        like: 22, id: 6,
        content:[`<p>Цифровизация стала одним из основных трендов в современной экономике. Компании активно внедряют цифровые технологии для улучшения своих бизнес-процессов и увеличения эффективности. Например, многие компании переходят на электронный документооборот, что позволяет им сократить время на обработку документов и повысить производительность труда. Также цифровизация открывает новые возможности для автоматизации производственных процессов и управления предприятием, что может значительно сократить издержки и увеличить прибыль компании. Однако для успешной цифровизации необходимо иметь квалифицированных специалистов и обеспечить безопасность цифровых данных, чтобы избежать утечек или кибератак.</p>`,
            `<p>Интернет вещей (IoT) становится все более популярным в мире. Благодаря возможности подключения к Интернету различных устройств, мы можем управлять домашней техникой, мониторить состояние здоровья или отслеживать местоположение объектов. IoT открывает новые возможности для автоматизации повседневных задач и улучшения качества жизни. Однако с ростом числа подключенных устройств возрастает и угроза кибератак, которые могут повредить личную жизнь и безопасность людей. Поэтому необходимо обращать внимание на защиту данных, использовать надежные устройства и обновлять программное обеспечение, чтобы минимизировать риски для себя и своих близких.</p>`,
            `<p>Большие данные (Big Data) стали важным ресурсом для многих компаний. Анализ больших объемов данных позволяет выявлять скрытые закономерности, прогнозировать тренды и принимать обоснованные решения. Например, розничные компании используют данные о покупках клиентов для персонализации рекламы и увеличения продаж. Однако для успешного использования больших данных необходимо иметь квалифицированных аналитиков и специалистов по обработке данных, чтобы извлечь из них максимальную пользу. Также следует уделять внимание безопасности данных, чтобы избежать утечек или кибератак, которые могут повредить репутацию компании и привести к финансовым потерям.</p>`,
            `<p>Цифровая экономика меняет привычные правила игры в бизнесе. Время от времени появляются новые технологии и модели бизнеса, которые требуют от компаний гибкости и быстрого реагирования на изменения в рыночной среде. Например, компании, которые не перешли к онлайн-продажам, могут рисковать потерять своих клиентов, которые предпочитают удобство и доступность интернет-магазинов. Для успешного развития в цифровом мире компании должны постоянно анализировать рынок, изучать потребности своих клиентов и искать новые способы удовлетворения их запросов. Только такие компании смогут оставаться востребованными и конкурентоспособными на рынке.</p>`,]
    },
    {
        title: 'Роль информационных технологий в науке 6',
        img: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT-WnGrsDiOQjfDpl4EZjg5hIyScMnM2OFSY6lXVuIZicO_ITeEwR_lN4_bQAcIDpvArTk&usqp=CAU',   description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Архипов Артур Егорович',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'физика'],
        trend: 'fizika',
        publication_date: '01.05.2024',
        show: 45,
        like: 22, id: 7,
        content:[
            `<p>Технологии изменили наш мир до неузнаваемости. Интернет открыл невиданные ранее возможности для общения и обмена информацией. С появлением смартфонов наша жизнь стала более мобильной, а доступ к знаниям и развлечениям стал практически неограниченным. Искусственный интеллект вошел во множество аспектов нашей жизни, повышая эффективность и предоставляя новые возможности для развития.</p>`,
            `<p>Социальные сети стали неизменной частью современной культуры. Люди используют их для общения, делятся своими мыслями и переживаниями, находят единомышленников. Однако, вместе с этим выросли и новые проблемы, такие как кибербуллинг и зависимость от социальных сетей. Тем не менее, их роль в жизни общества остается крайне важной и значимой, влияя на множество аспектов нашего бытия.</p>`,
            `<p>Интернет вещей соединяет различные устройства в одну экосистему, создавая умные города и дома. Данный подход повышает эффективность использования ресурсов и улучшает качество жизни. Однако, растущая зависимость от технологий вызывает вопросы безопасности и приватности данных. Компании должны приложить усилия, чтобы обеспечить надежную защиту информации своих пользователей, минимизируя риски утечек.</p>`,
            `<p>Блокчейн и криптовалюты представляют собой инновационные подходы к финансовым операциям. Эти технологии обеспечивают безопасность и прозрачность транзакций. Однако, их широкое распространение требует регулирования и согласования с финансовым сектором. Блокчейн может быть использован не только в финансовых приложениях, но и в других сферах, таких как здравоохранение и право.</p>`,
            `<p>Автономные транспортные средства, такие как беспилотные автомобили и дроны, предоставляют новые возможности для логистики и транспорта. Их внедрение способствует снижению аварийности и повышению эффективности перевозок. Однако, до широкомасштабного применения этих технологий остается много вопросов, связанных с безопасностью, законодательством и этическими аспектами.</p>`,
            `<p>Машинное обучение и искусственный интеллект находят применение в здравоохранении, образовании и бизнесе. Эти технологии способны анализировать огромные массивы данных, прогнозировать тенденции и предлагать решения. В здравоохранении они могут помогать в диагностике заболеваний и разработке индивидуальных планов лечения. В образовании - создавать персонализированные программы обучения для студентов.</p>`,
            `<p>Технологии виртуальной и дополненной реальности открывают новые горизонты в области развлечений, обучения и работы. Виртуальные миры позволяют пользователям погружаться в полностью цифровую среду, а дополненная реальность - усовершенствовать восприятие окружающего мира. Эти технологии применяются в различных сферах, от игровой индустрии до медицины, делая процессы более увлекательными и эффективными.</p>`,
            `<p>Облачные вычисления предоставляют надежные и гибкие ресурсы для хранения данных и выполнения различных задач. Компании могут масштабировать свои приложения и услуги, не заботясь о физической инфраструктуре. Однако, важным аспектом остается безопасность данных. Необходимо обеспечивать защиту информации пользователей, выбирая надежных провайдеров и внедряя современные методы шифрования.</p>`,
            `<p>Развитие технологий связи, таких как 5G, обеспечит более высокие скорости передачи данных и улучшит качество интернета. Это открывает новые возможности для развития интернета вещей, автономных транспортных систем и других технологий. Однако, внедрение 5G требует значительных инвестиций и разработки новой инфраструктуры. Также важно учитывать экологические аспекты и возможное воздействие на здоровье людей.</p>`,
            `<p>Будущее технологий представляется захватывающим и полным новых возможностей. Важно быть готовыми к изменениям и активно адаптироваться к новым реалиям. Необходимо развивать навыки, которые будут актуальными в будущем, и использовать технологии для улучшения качества жизни. Образование и постоянное обучение станут важнейшими аспектами успешной адаптации к быстро меняющемуся миру технологий.</p>`,

        ]
    },
    {
        title: 'Роль информационных технологий в науке 7',
        img: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQosrHSmWyhPwruO5DgLROpl6X0-75-OuXQiCv6U24gb-uWsapXsG4nYq0HZmz3xvGTemk&usqp=CAU',   description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Иванов Михаил Александрович',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'физика'],
        trend: 'fizika',
        publication_date: '01.05.2024',
        show: 5,
        like: 22, id: 8,
        content:[ 
            `<p>Развитие технологий интернета позволило значительно улучшить качество жизни. Мы получили доступ к массивам информации, которые ранее были недоступны. Онлайн-обучение, телемедицина и дистанционная работа стали обычным явлением. Широкие возможности общения и обмена данными увеличили глобализацию и ускорили процесс обмена знаниями и идеями.</p>`,

            `<p>Исследования в области искусственного интеллекта продолжают впечатлять. Глубокое обучение и нейронные сети находят применение в различных отраслях. Автоматизация рутинных процессов и улучшение аналитических систем повышают эффективность работы. Однако важным аспектом остается этичное использование технологий, чтобы они приносили пользу обществу.</p>`,
        
            `<p>Социальные сети открывают новые возможности для взаимодействия и самовыражения. Миллионы людей ежедневно делятся своими мыслями и опытом. Важно помнить о цифровой гигиене и кибербезопасности. Компании разрабатывают новые инструменты для защиты личных данных пользователей и борьбы с киберугрозами, обеспечивая безопасное использование платформ.</p>`,
        
            `<p>Проектирование умных городов становится актуальной задачей для урбанистов. Использование интернета вещей помогает улучшить управление городскими ресурсами. Система умных светофоров, мониторинг состояния окружающей среды и контроля энергопотребления делают города более удобными и экологически чистыми. Тактико-стратегические планы разрабатываются на основе анализа данных.</p>`,
        
            `<p>Блокчейн-технологии внедряются не только в финансовом секторе, но и в других областях. Прозрачность и безопасность транзакций делают блокчейн привлекательным для логистики и управления цепочками поставок. Однако требуется законодательная база, которая обеспечит правовую защиту и предсказуемость использования этих технологий в долгосрочной перспективе.</p>`,
        
            `<p>Автомобильная индустрия переживает революцию благодаря автономным транспортным средствам. Беспилотные автомобили обещают снизить аварийность и улучшить дорожную ситуацию. Однако важно заранее решить вопросы правового регулирования, а также обеспечить высокую надежность и безопасность таких систем в реальных условиях эксплуатации.</p>`,
        
            `<p>Развитие облачных технологий позволяет компаниям и частным пользователям хранить и обрабатывать данные на удаленных серверах. Облака предоставляют гибкость и масштабируемость, снижая затраты на поддержание инфраструктуры. Но остается необходимость в строгом контроле безопасности данных и защите информации от возможных кибератак и взломов.</p>`,       
        
        ]
    },
    {
        title: 'Роль информационных технологий в науке 8',
        img: 'https://cdnn21.img.ria.ru/images/07e7/04/0c/1864817072_0:222:3068:1948_1920x0_80_0_0_cc85f54135fd8b85116bda169e5a945e.jpg',   description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Соколова Мария Захаровна',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'роботехника'],
        trend: 'robototekhnika',
        publication_date: '01.05.2024',
        show: 45,
        like: 22, id: 9,
        content:[
            `<p>Блокчейн-технологии внедряются не только в финансовом секторе, но и в других областях. Прозрачность и безопасность транзакций делают блокчейн привлекательным для логистики и управления цепочками поставок. Однако требуется законодательная база, которая обеспечит правовую защиту и предсказуемость использования этих технологий в долгосрочной перспективе.</p>`,

            `<p>Автомобильная индустрия переживает революцию благодаря автономным транспортным средствам. Беспилотные автомобили обещают снизить аварийность и улучшить дорожную ситуацию. Однако важно заранее решить вопросы правового регулирования, а также обеспечить высокую надежность и безопасность таких систем в реальных условиях эксплуатации.</p>`,
        
            `<p>Развитие облачных технологий позволяет компаниям и частным пользователям хранить и обрабатывать данные на удаленных серверах. Облака предоставляют гибкость и масштабируемость, снижая затраты на поддержание инфраструктуры. Но остается необходимость в строгом контроле безопасности данных и защите информации от возможных кибератак и взломов.</p>`,
        
            `<p>Инновации в области биотехнологий открывают новые горизонты в медицине и сельском хозяйстве. Генетическое редактирование и персонализированная медицина обещают улучшить качество жизни и увеличить продолжительность жизни. Этические вопросы также играют важную роль в исследовательской и прикладной деятельности, чтобы минимизировать возможные риски.</p>`,
        
            `<p>Технологии дополненной и виртуальной реальности находят все больше применений в различных областях. Они меняют подход к обучению, развлечениям и работе. Обучающие симуляторы и интерактивные туры предоставляют новые возможности для изучения предметов и навыков. Важно продолжать исследования по улучшению пользовательского опыта и безопасности использования AR/VR-технологий.</p>`,
        
            `<p>Энергетическая отрасль активно внедряет устойчивые технологии производства и использования энергии. Соларные панели, ветряные турбины и умные сети становятся частью новой инфраструктуры. Эти инновации помогают сократить выбросы и улучшить энергоэффективность. Совместные усилия правительств, бизнеса и науки ускоряют переход к экологически чистой энергетике.</p>`,
          
        ]
    },
    {
        title: 'Роль информационных технологий в науке 9',
        img: 'https://acropolis.org.ru/img/site/image/calennum7148/imgtop/chemistry-engine.jpg',   description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        avtor:{
            avatar:'',
            fullname:'Бородин Никита Романович',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        tags: ['статья', 'роботехника'],
        trend: 'robototekhnika',
        publication_date: '01.05.2024',
        show: 15,
        like: 22, id: 10,
        content:[
            `<p>В последние годы стало очевидно, что отрасль информационных технологий является одной из самых быстроразвивающихся в мире. Новые технологии появляются каждый день, а старые устаревают с каждым месяцем. Компании, которые не следят за изменениями в индустрии, рискуют остаться далеко позади своих конкурентов. Поэтому так важно постоянно обновлять свои знания и навыки, чтобы быть в курсе последних трендов. Недавно ученые обнаружили новый вид вируса, который способен обойти большинство существующих антивирусных программ. Компании, которые не обновили свои защитные меры, подвергают себя серьезному риску стать жертвами кибератак. Поэтому следует уделить большое внимание обновлению программного обеспечения и регулярному обучению сотрудников в области информационной безопасности.</p>`,
            `<p>Цифровая трансформация трансформировала бизнес-процессы во многих отраслях. Компании, которые не перешли к использованию цифровых технологий, могут рисковать оставаться в прошлом и упускать возможности для развития. Например, многие банки перешли к онлайн-банкингу, что позволило им сократить издержки и улучшить обслуживание клиентов. Также сфера медицины не осталась в стороне и начала активно использовать цифровые технологии для диагностики и лечения пациентов. В целом, цифровая трансформация может принести множество преимуществ как для бизнеса, так и для общества в целом.</p>`,
            `<p>Интернет стал неотъемлемой частью нашей повседневной жизни. Мы используем его для работы, общения, развлечений и многих других целей. Однако вместе с удобствами Интернета приходят и опасности. В последнее время все чаще случаются кибератаки, когда злоумышленники пытаются получить доступ к личной информации пользователей или организаций. Для защиты от таких атак необходимо следить за обновлениями программного обеспечения, использовать надежные пароли и обучать сотрудников правилам информационной безопасности. Без должной защиты мы можем стать жертвами киберпреступников и понести серьезные убытки.</p>`,
            `<p>Технологии блокчейн начинают находить применение в различных отраслях, начиная от финансов и заканчивая здравоохранением. Благодаря прозрачности и безопасности этой технологии, многие компании видят в ней потенциал для улучшения своих бизнес-процессов. Например, блокчейн может быть использован для повышения эффективности цепочки поставок или для хранения медицинских данных пациентов. Однако внедрение блокчейна требует значительных усилий и инвестиций, поэтому не все компании готовы к такому шагу. Но те, кто решатся на использование этой технологии, могут получить серьезные конкурентные преимущества и укрепить свои позиции на рынке.</p>`,
            `<p>Искусственный интеллект становится все более популярным в различных отраслях, начиная от производства и заканчивая медициной. Благодаря возможности автоматизировать рутинные задачи и анализировать большие данные, искусственный интеллект может значительно улучшить эффективность бизнес-процессов и помочь принимать более обоснованные решения. Например, в розничной торговле искусственный интеллект может предсказывать спрос на определенные товары и оптимизировать запасы на складе, что позволяет снизить издержки и увеличить прибыль. Однако использование искусственного интеллекта требует больших инвестиций и обучения персонала, поэтому не все компании могут себе это позволить.</p>`,
        ]
    },
    {
        title: 'Роль информационных технологий в науке 10',
        img: 'https://www.ystu.ru/upload/resize_cache/webp/iblock/3e4/dd7pgkmdmlce8qmx6jm118b2sa7hegzh/1674659573_top_fon_com_p_fon_dlya_prezentatsii_farmatsevtika_195.webp',   description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        tags: ['статья', 'роботехника'],
        avtor:{
            avatar:'',
            fullname:'Колесников Никита Александрович',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        trend: 'robototekhnika',
        publication_date: '01.05.2024',
        show: 65,
        like: 22, id: 11,
        content:[
            `<p>Искусственный интеллект становится все более популярным в различных отраслях, начиная от производства и заканчивая медициной. Благодаря возможности автоматизировать рутинные задачи и анализировать большие данные, искусственный интеллект может значительно улучшить эффективность бизнес-процессов и помочь принимать более обоснованные решения. Например, в розничной торговле искусственный интеллект может предсказывать спрос на определенные товары и оптимизировать запасы на складе, что позволяет снизить издержки и увеличить прибыль. Однако использование искусственного интеллекта требует больших инвестиций и обучения персонала, поэтому не все компании могут себе это позволить.</p>`,
            `<p>Экологические проблемы становятся все более острыми в современном мире. Из-за загрязнения окружающей среды и изменений климата многие виды животных и растений находятся под угрозой исчезновения. Чтобы сохранить биоразнообразие планеты, необходимо принимать активные меры по охране окружающей среды. Компании также могут внести свой вклад в решение экологических проблем, например, переходя на использование возобновляемых источников энергии или сокращая выбросы вредных веществ в атмосферу. Такие шаги могут не только улучшить состояние окружающей среды, но и принести экономические выгоды компаниям, которые заботятся о природе.</p>`,
            `<p>Глобализация привела к сокращению расстояний между странами и увеличению международной торговли. Компании теперь могут легко расширять свое присутствие на мировом рынке и конкурировать с иностранными компаниями. Однако глобализация также обладает и негативными последствиями, такими как увеличение конкуренции и перераспределение рабочих мест. Для того чтобы выжить в условиях глобализации, компании должны быть гибкими и адаптивными, быстро реагировать на изменения в мировой экономике и постоянно совершенствовать свои продукты и услуги. Только такие компании смогут сохранить свои позиции на рынке и обеспечить свое долгосрочное развитие.</p>`,
            `<p>Инновации играют ключевую роль в развитии современной экономики. Компании, которые инвестируют в научные исследования и разработки новых продуктов, получают конкурентные преимущества и могут стать лидерами своей отрасли. Инновации позволяют сокращать издержки, улучшать качество продукции и расширять ассортимент предлагаемых услуг. Однако не все компании готовы к изменениям и рискуют застрять в прошлом. Для того чтобы оставаться конкурентоспособными, компании должны постоянно искать новые идеи и технологии, которые помогут им преуспеть на рынке и достичь своих бизнес-целей.</p>`,
            `<p>Образование играет важную роль в жизни каждого человека. Оно дает нам знания и навыки, необходимые для развития и самореализации. Однако современная система образования не всегда отвечает на современные вызовы и требования рынка труда. Многие выпускники сталкиваются с проблемой недостатка практических знаний и навыков, которые необходимы для успешной карьеры. Для того чтобы улучшить качество образования, необходимо совершенствовать учебные программы, обновлять учебные материалы и обучать преподавателей современным методикам преподавания. Только такие шаги могут помочь выпускникам стать успешными специалистами и конкурентоспособными на рынке труда.</p>`,
            `<p>Мы живем в эпоху информационного общества, где доступ к знаниям и информации стал легким и быстрым. Интернет позволяет нам получать любую информацию в любое время и из любого места. Однако с ростом объема информации возникает проблема фильтрации и оценки ее достоверности. Не все источники информации можно считать надежными, поэтому важно научиться отличать правду от лжи и критически мыслить. Также следует помнить о защите личной информации в сети, чтобы не стать жертвой киберпреступников. Только обладая хорошими навыками информационной грамотности, мы сможем эффективно использовать ресурсы Интернета и извлечь из них максимальную пользу для себя и для общества.</p>`,]
    },
    {
        title: 'Роль информационных технологий в науке 11',
        img: 'https://sotni.ru/wp-content/uploads/2023/08/biologiia-2.webp',   description:'Статья посвящена применению информационных технологий в биологии, которые открывают новые горизонты для исследований, диагностики и лечения заболеваний, а также способствуют развитию персонализированной медицины.',
        tags: ['статья', 'биология'],
        avtor:{
            avatar:'',
            fullname:'Никифорова Оливия Ярославовна',
            place_work:'Институт Информационных Технологий'
        },
        source:'#',
        source__text:'ссылка_на_райт.ру',
        trend: 'biologiya',
        publication_date: '01.05.2024',
        show: 25,
        like: 22, id: 12,
        content:[`<p>Цифровизация стала одним из основных трендов в современной экономике. Компании активно внедряют цифровые технологии для улучшения своих бизнес-процессов и увеличения эффективности. Например, многие компании переходят на электронный документооборот, что позволяет им сократить время на обработку документов и повысить производительность труда. Также цифровизация открывает новые возможности для автоматизации производственных процессов и управления предприятием, что может значительно сократить издержки и увеличить прибыль компании. Однако для успешной цифровизации необходимо иметь квалифицированных специалистов и обеспечить безопасность цифровых данных, чтобы избежать утечек или кибератак.</p>`,
            `<p>Интернет вещей (IoT) становится все более популярным в мире. Благодаря возможности подключения к Интернету различных устройств, мы можем управлять домашней техникой, мониторить состояние здоровья или отслеживать местоположение объектов. IoT открывает новые возможности для автоматизации повседневных задач и улучшения качества жизни. Однако с ростом числа подключенных устройств возрастает и угроза кибератак, которые могут повредить личную жизнь и безопасность людей. Поэтому необходимо обращать внимание на защиту данных, использовать надежные устройства и обновлять программное обеспечение, чтобы минимизировать риски для себя и своих близких.</p>`,
            `<p>Большие данные (Big Data) стали важным ресурсом для многих компаний. Анализ больших объемов данных позволяет выявлять скрытые закономерности, прогнозировать тренды и принимать обоснованные решения. Например, розничные компании используют данные о покупках клиентов для персонализации рекламы и увеличения продаж. Однако для успешного использования больших данных необходимо иметь квалифицированных аналитиков и специалистов по обработке данных, чтобы извлечь из них максимальную пользу. Также следует уделять внимание безопасности данных, чтобы избежать утечек или кибератак, которые могут повредить репутацию компании и привести к финансовым потерям.</p>`,
            `<p>Цифровая экономика меняет привычные правила игры в бизнесе. Время от времени появляются новые технологии и модели бизнеса, которые требуют от компаний гибкости и быстрого реагирования на изменения в рыночной среде. Например, компании, которые не перешли к онлайн-продажам, могут рисковать потерять своих клиентов, которые предпочитают удобство и доступность интернет-магазинов. Для успешного развития в цифровом мире компании должны постоянно анализировать рынок, изучать потребности своих клиентов и искать новые способы удовлетворения их запросов. Только такие компании смогут оставаться востребованными и конкурентоспособными на рынке.</p>`,]
    },
]


export function getById (id) {
    return data.filter(el => {
        return el.id === id})
}

export function randomArticle (id, count) {
    const idArr = [id];
    const arrContnent = [];

    while (arrContnent.length < count) {
        let randomIndex = Math.floor(Math.random() * data.length);
        if (!idArr.includes(randomIndex)) {
            idArr.push(randomIndex);
            arrContnent.push(data[randomIndex]);
        }
    }
    return arrContnent
}

export function getAll () {
    return data
}

export function getTrend (trend) {
    return data.filter(el => el.trend === trend)
}



